---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationGUID(System.Int32)
source: html/6683f61e-3f39-91bb-857a-74d54f78154a.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationGUID Method

Gets the specification GUID by its identifier.

## Syntax (C#)
```csharp
public Guid GetSpecificationGUID(
	int specificationId
)
```

## Parameters
- **specificationId** (`System.Int32`) - The specification identifier.

## Returns
The specification GUID. Returns empty GUID if not found.